FemDesign.Loads.PressureLoad
pressure_load_type.

FemDesign.Loads.PressureLoad.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.PressureLoad.#ctor(FemDesign.Geometry.Region,FemDesign.Geometry.Vector3d,System.Double,System.Double,System.Double,FemDesign.Loads.LoadCase,System.String,System.Boolean,FemDesign.Loads.ForceLoadType)
Pressure load
region:
loadDirection: Vector. Direction of force.
z0: Surface level of soil/water (on the global Z axis).
q0: Load intensity at the surface level.
qh: Increment of load intensity per meter (along the global Z axis).
loadCase: LoadCase.
comment: Comment.
loadProjection:
loadType: